
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8672718680)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.google_iam_policy.noauth: Reading...
google_project_service.firestore_api: Refreshing state... [id=lgtmgen-project/firestore.googleapis.com]
google_firestore_database.datastore_mode_database: Refreshing state... [id=projects/lgtmgen-project/databases/(default)]
google_artifact_registry_repository.main-repo: Refreshing state... [id=projects/lgtmgen-project/locations/asia-northeast1/repositories/dev-main]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]
google_project_service.vision_api: Refreshing state... [id=lgtmgen-project/vision.googleapis.com]
google_cloud_run_service.cloudrun-dev-main-backend: Refreshing state... [id=locations/asia-northeast1/namespaces/lgtmgen-project/services/dev-main-backend]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/lgtmgen-project/locations/asia-northeast1/services/dev-main-backend]
google_cloud_run_domain_mapping.domain-mapping: Refreshing state... [id=locations/asia-northeast1/namespaces/lgtmgen-project/domainmappings/lgtm.a.shion.pro]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.domain-mapping is tainted, so must be replaced
-/+ resource "google_cloud_run_domain_mapping" "domain-mapping" {
      ~ id       = "locations/asia-northeast1/namespaces/lgtmgen-project/domainmappings/lgtm.a.shion.pro" -> (known after apply)
        name     = "lgtm.a.shion.pro"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "Caller is not authorized to administer the domain 'lgtm.a.shion.pro'. If you own 'lgtm.a.shion.pro', you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=lgtm.a.shion.pro. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Certificate will not be provisioned unless the domain is made routable."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = "Caller is not authorized to administer the domain 'lgtm.a.shion.pro'. If you own 'lgtm.a.shion.pro', you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=lgtm.a.shion.pro. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "DomainRoutable"
                    },
                ]
              - observed_generation = 1
              - resource_records    = []
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "4efe2e1e-182d-416c-b5ad-e1a882ffa8ca"
              - "serving.knative.dev/creator"      = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> (known after apply)
          ~ generation            = 1 -> 0
          - labels                = {} -> null
          ~ resource_version      = "AAYV95Mf7bA" -> (known after apply)
          ~ self_link             = "/apis/domains.cloudrun.com/v1/namespaces/228944830644/domainmappings/lgtm.a.shion.pro" -> (known after apply)
          ~ terraform_labels      = {} -> (known after apply)
          ~ uid                   = "26321465-28b3-44a0-aa8c-d68953109cd1" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - force_override   = false -> null
            # (2 unchanged attributes hidden)
        }
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
google_cloud_run_domain_mapping.domain-mapping: Destroying... [id=locations/asia-northeast1/namespaces/lgtmgen-project/domainmappings/lgtm.a.shion.pro]
google_storage_bucket.public_image_bucket: Modifying... [id=lgtm-public-image-bucket]
google_cloud_run_domain_mapping.domain-mapping: Destruction complete after 1s
google_cloud_run_domain_mapping.domain-mapping: Creating...
google_storage_bucket.public_image_bucket: Modifications complete after 1s [id=lgtm-public-image-bucket]
╷
│ Error: Error waiting to create DomainMapping: resource is in failed state "Ready:False", message: Caller is not authorized to administer the domain 'lgtm.a.shion.pro'. If you own 'lgtm.a.shion.pro', you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=lgtm.a.shion.pro. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com').
│ 
│   with google_cloud_run_domain_mapping.domain-mapping,
│   on cloudrun.tf line 36, in resource "google_cloud_run_domain_mapping" "domain-mapping":
│   36: resource "google_cloud_run_domain_mapping" "domain-mapping" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":12,"Program":"tfcmt","SHA1":"469b640715b6aec08494df43969f41f48cef0d38","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->